[
	{
		"title": "Twitter risks billions in fines following ignorance of consent order",
		"description": "[An FTC consent order](https://www.ftc.gov/system/files/ftc_gov/pdf/2023062C4316TwitterModifiedOrder.pdf) signed in 2011 requires the company to send a compliance notice following a change in company management, and requires the company to assess privacy issues of new changes made to the service, or face billions in fines. The compliance notice has yet to be sent.\n\n* [\"Elon Musk is putting Twitter at risk of billions in fines, warns company lawyer\"](https://www.theverge.com/2022/11/10/23451198/twitter-ftc-elon-musk-lawyer-changes-fine-warning), *The Verge*.",
		"date": "November 10, 2022"
	},
	{
		"title": "Twitter's head of privacy, information security, and compliance resign",
		"description": "An internal message obtained by various news sources and accounts from two employees have stated that Twitter's chief privacy officer Damien Kieran, chief information security officer Lea Kissner, and chief compliance officer Marianne Fogarty have resigned. At least one executive, Kissner, has [confirmed](https://twitter.com/LeaKissner/status/1590706305102381058) their departure.",
		"date": "November 10, 2022"
	},
	{
		"title": "Sports Twitter grapples with impostor accounts",
		"description": "Various accounts pretending to be journalists and other influencial figures in sports have began appearing, following the release of paid verification through Twitter Blue. Although Twitter has promised to crack down on these accounts, other accounts, such as one pretending to be sportswriter Adam Schefter, have persisted. The tweets made by these accounts are intended to deceive; the account pretend to be sportswriter Adam Schefter posted a tweet stating that Las Vegas Raiders head coach Josh McDaniels had left the position.\n\n* [\"Sports Twitter is now a verified hellhole thanks to Elon Musk\"](https://www.sbnation.com/2022/11/9/23450014/sports-twitter-parody-accounts-elon-musk), *SBNation*.",
		"date": "November 9, 2022"
	},
	{
		"title": "Verified users begin impersonating Elon",
		"description": "Multiple verified accounts have begun impersonating Elon Musk on Twitter, including podcaster [Matt Helgeson](https://twitter.com/MattHelgeson), former American football player and writer [Chris Kluwe](https://twitter.com/ChrisWarcraft), cartoonist [Jeph Jacques](https://twitter.com/jephjacques), comedian [Kathy Griffin](https://twitter.com/kathygriffin), actress [Valerie Bertinelli](https://twitter.com/wolfiesmom), and comedian [Sarah Silverman](https://twitter.com/SarahKSilverman). Although activity from these accounts has subsided, these accounts largely criticized Elon, with many of them making humorous statements at his expense, and retweeting tweets made by Democratic figures.",
		"date": "November 6, 2022"
	},
	{
		"title": "Tesla, Boring Company, and SpaceX engineers accidentally leave Slack channels public",
		"description": "In a [tweet](https://twitter.com/GergelyOrosz/status/1588906808395333633) by Gergely Orosz, author of The Pragmatic Engineer, employees for Tesla, Boring Company, and SpaceX engineers working on Twitter created Slack channels for internal communications that were accidentally left public. Detailed in these channels were Elon's plans for Twitter, including querying for lines committed and forming a list of people to be fired.",
		"date": "November 5, 2022"
	},
	{
		"title": "Advertisers fail to reach a middle ground with Elon",
		"description": "[Adweek](https://www.adweek.com/media/elon-musk-fails-to-answer-brands-questions-in-private-meetings/) is reporting that Elon refused to answer multiple questions in a meeting conducted by Elon with advertisers. Ebiquity, an advertising firm that tracks media spending, contacted multiple advertisers, including Sony, Nestle, Subway and Mazda, regarding Twitter advertisements; nine out of the 17 companies they contacted instructed their agencies to pause advertising on Twitter.\n\n* [\"Elon Musk Fails to Answer Brands' Questions in Private Meetings\"](https://www.adweek.com/media/elon-musk-fails-to-answer-brands-questions-in-private-meetings/), *Adweek*.",
		"date": "November 5, 2022"
	},
	{
		"title": "Twitter layoffs occur, gutting employees and affecting critical teams",
		"description": "Twitter's [haphazard](https://www.nytimes.com/2022/11/04/technology/elon-musk-twitter-layoffs.html) layoffs left teams, including those involved in combatting election misinformation days before the U.S. midterms, partially or completed gutted, as the November 7 deadline for paid verification in Twitter Blue looms over employees into the weekend. In addition to the [ousting](https://www.theverge.com/2022/10/27/23184519/elon-musk-twitter-acquisition-deal-complete-agreement) of Twitter's executives a week prior, Twitter's vice president of consumer product engineering Arnaud Weber has also been laid off. Among those laid off [include](https://www.cnn.com/2022/11/03/tech/twitter-layoffs/index.html) members of Twitter's human rights team, responsible for protecting those in global conflicts, and the curation team, which elevates reliable information. The swiftness of the layoffs have been criticized, and some employees were locked out of Twitter's internal systems during late-night meetings.\n\n* [\"Elon Musk’s Twitter layoffs leave whole teams gutted\"](https://www.theverge.com/2022/11/4/23439790/elon-musk-twitter-layoffs-trust-and-safety-teams-severance), *The Verge*.",
		"date": "November 4, 2022"
	},
	{
		"title": "General Mills, Audi, Pfizer, and Mondelez International pause Twitter ads",
		"description": "American food companies General Mills and Mondelez International, pharmaceutical company Pfizer, and German automotive manufacturer Audi, owned by Volkswagen, have reportedly paused advertisements on Twitter.\n\n* [\"General Mills, Audi and Pfizer Join Growing List of Companies Pausing Twitter Ads\"](https://www.wsj.com/articles/general-mills-audi-and-pfizer-join-growing-list-of-companies-pausing-twitter-ads-11667507765), *The Wall Street Journal*.",
		"date": "November 3, 2022"
	},
	{
		"title": "Twitter is sued for unannounced mass layoffs",
		"description": "Following [earlier reports](https://www.theverge.com/2022/11/3/23439802/elon-musks-twitter-layoffs-start-friday-november-4) that a large-scale layoff of Twitter's workforce would begin on November 4, [Bloomberg](https://www.bloomberg.com/news/articles/2022-11-04/twitter-sued-for-mass-layoffs-by-musk-without-enough-notice) is reporting that a class-action lawsuit has been filed, citing the WARN Act, which requires companies to provide a 60-day advance notification of mass layoffs.\n\n* [\"Twitter Sued for Mass Layoffs by Musk Without Enough Notice\"](https://www.bloomberg.com/news/articles/2022-11-04/twitter-sued-for-mass-layoffs-by-musk-without-enough-notice), *Bloomberg*",
		"date": "November 3, 2022"
	},
	{
		"title": "Twitter employees crunch to meet Elon's November 7 deadline",
		"description": "Twitter employee Evan Jones posted [an image](https://twitter.com/evanstnlyjones/status/1587690084064669701) on Twitter captioned, \"When you need something from your boss at elon twitter\", with Twitter employee Esther Crawford photographed sleeping on the floor to meet the [November 7](https://www.theverge.com/2022/10/30/23431931/twitter-paid-verification-elon-musk-blue-monthly-subscription) deadline proposed by Elon. [CNBC](https://news.yahoo.com/twitter-staff-told-84-hour-111714755.html) has previously reported that employees have been told to work 12-hour shifts, seven days a week, and Tesla employees have been recruited to do code reviews at Twitter.",
		"date": "November 2, 2022"
	},
	{
		"title": "The Interpublic Group of Companies recommends clients pause advertising on Twitter",
		"description": "The Interpublic Group of Companies (IPG), one of the largest advertising companies, issued a statement recommending its clients pause advertising on Twitter due to moderation concerns. The Global Alliance for Responsible Media, an initiative by the World Federation of Advertisers, has also stated it will be monitoring Twitter's content moderation policies.\n\n* [\"Elon Musk’s Twitter Faces Exodus of Advertisers and Executives\"](https://www.nytimes.com/2022/11/01/technology/elon-musk-twitter-advertisers.html), *The New York Times*",
		"date": "November 1, 2022"
	},
	{
		"title": "Twitter's head of advertising, product, and core engineering resign",
		"description": "Twitter's head of advertising Sarah Personette, head of engineering Nick Caldwell, and head of product Jay Sullivan have resigned.\n\n* [\"Twitter’s head of advertising, product, and core engineering have all left the company.\"](https://www.theverge.com/2022/11/1/23435042/twitters-head-of-advertising-product-and-core-engineering-have-all-left-the-company), *The Verge*",
		"date": "November 1, 2022"
	},
	{
		"title": "Twitter's planned paid verification system inspires scammers",
		"description": "The confusion surrounding Twitter's paid verification system, set to be released on November 7, has resulted in scams taking advantage of the chaos. One such phishing campaign, as reported by [TechCrunch](https://techcrunch.com/2022/10/31/twitter-verification-phishing/), targets verified accounts. The scam, which used Google Sites, has since been taken down.\n\n* [\"Twitter’s verification chaos is now a cybersecurity problem\"](https://techcrunch.com/2022/10/31/twitter-verification-phishing/), *TechCrunch*",
		"date": "October 31, 2022"
	}
]
